In [1]:
import pandas as pd

In [2]:
#data sets

data1={"Id":["S01","S02","S03","S04","S05","S06"],
       "Student":["Mukund","Sachin","Rajesh","Girish","Mohan","Amit"],
       "Roll_No":[101,102,103,104,105,108]
      }
data2={
    "Rank":[1,4,3,5,2,6],
    "Marks":[95,70,80,74,60,40]
}

In [4]:
df1=pd.DataFrame(data1)
df1

    Id Student  Roll_No
0  S01  Mukund      101
1  S02  Sachin      102
2  S03  Rajesh      103
3  S04  Girish      104
4  S05   Mohan      105
5  S06    Amit      108

In [5]:
df2=pd.DataFrame(data2)

In [6]:
df2

   Rank  Marks
0     1     95
1     4     70
2     3     80
3     5     74
4     2     60
5     6     40

In [7]:
df3=df1.join(df2)

In [8]:
df3

    Id Student  Roll_No  Rank  Marks
0  S01  Mukund      101     1     95
1  S02  Sachin      102     4     70
2  S03  Rajesh      103     3     80
3  S04  Girish      104     5     74
4  S05   Mohan      105     2     60
5  S06    Amit      108     6     40